CHr41/cpm200/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    movingWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
20
(
8.38525
8.38525
8.38525
8.38525
8.38525
8.38525
8.38525
8.38525
8.38525
8.38525
8.38525
8.38525
8.38525
8.38525
8.38525
8.38525
8.38525
8.38525
8.38525
8.38525
)
;
    }
    fixedWalls
    {
        type            calculated;
        value           nonuniform List<scalar> 
60
(
8.38525
8.38525
8.38525
8.38525
8.38525
8.38525
8.38525
8.38525
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
